[ArchonShaman X2CharacterTemplate]
strCharacterName="Archon Shaman"

[CorpseArchonShaman X2ItemTemplate]
FriendlyName="Archon Shaman Corpse"
FriendlyNamePlural="Archon Shaman Corpses"
BriefSummary="This Archon is unique, in that it can raise the dead as well as keep itself alive a lot longer than other Archon types. Hence why it has been named Witch Doctor by the troops."

[Autopsy_ArchonShaman X2TechTemplate]
DisplayName="Archon Shaman Autopsy"
Summary="The Archon Shaman, nicknamed Witch Doctor Is strong, deadly, and if left unchecked, can raise its own army of the dead. It can also regenerate health as well as steal health from its attacked target."
CodeName="Witch Doctor"
LongDescription="These ARCHONS are a rather brutal type. The Shaman's look isn't as beautiful as other Archons we've seen in the past. They adorn themselves with skulls from their victims and even cover themselves in WAR PAINT to intimidate their enemies. Do not let them get close or they can leetch health from you. Thier victoms that are lucky enough to die a quick death, are brought back as Zombies."

[ShamanConsume X2AbilityTemplate]
LocFriendlyName="Consume"
LocFlyOverText="Consume"
LocHelpText="Consume HP from targets and if killed, turning them into zombies."
LocLongDescription="The ability drains HP. If target is killed, and human or advent, it will become a zombie."
LocPromotionPopupText="<Bullet/> Drain HP with hit on target, with a killing blow turning them into a zombie."

[ArchonShaman_ConsumeStaff X2WeaponTemplate]
FriendlyName="Archon Consume Staff"
FriendlyNamePlural="Archon Consume Staves"
BriefSummary="This Staff will drain HP as well as raise the dead as zombies."
TacticalText="<Bullet/> Drain HP.\n<Bullet/> Can also raise dead killed by it, turning them into zombies."

[ArchonWarrior X2CharacterTemplate]
strCharacterName="Archon Warrior"

[CorpseArchonWarrior X2ItemTemplate]
FriendlyName="Archon Warrior Corpse"
FriendlyNamePlural="Archon Warrior Corpses"
BriefSummary="This Archon WARRIOR is clearly meant to be a close combat brawler. It has the ability to regen HP but its most dangerous in close with its Stun Axe."

[Autopsy_ArchonWarrior X2TechTemplate]
DisplayName="Archon Warrior Autopsy"
Summary="The Archon Warrior, nicknamed Centurion Is quick, deadly, and is not scared to rush. It can also utilize a deadly teleportation ability."
CodeName="Centurion"
LongDescription="The aliens want us to think these ARCHONS are a new breed of Alien. And to the common man and those blinded by the Archon's rather beautiful look, that is the case. BUT It would seem that the Archon is nothing more than a glorified TROJAN HORSE ploy to hide the shriveled, rotting husks of the ones called FLOATERS that we once fought in the first war."

[ArchonAxe X2WeaponTemplate]
FriendlyName="Archon Axe"
FriendlyNamePlural="Archon Axes"
BriefSummary="This Axe hits hard and has the ability to stun."
TacticalText="<Bullet/> Close Combat oriented and deadly.\n<Bullet/> Can also stun a soldier that is hit by it."

[ArchonVest X2EquipmentTemplate]
FriendlyName="Archon Vest"
FriendlyNamePlural="Archon Vests"
BriefSummary="The Archon Vest adds the Archon Warriors's deadly speed to your soldier."
TacticalText="<bullet/> Increases soldier health by 2 and mobility by 3."

[VestInspire X2AbilityTemplate]
LocFriendlyName="Vest Inspire"
LocFlyOverText="Vest Inspire"
LocHelpText="Inspire yourself or a Squadmate."
LocLongDescription=" Ever needed to just talk yourself through a bad situation? How about offer some encouragement to a squadmate? This Vest has been designed to calmly grant inspire on yourself or a squadmate for a 3rd action that round of play. This Vest's granted inspier ability is also a free action by the vest wearer."
LocPromotionPopupText="<Bullet/> Through the Vest inspire Ability, this vest can grant a 3rd action with a 4 turn cooldown."

[AdvancedMindShield X2EquipmentTemplate]
FriendlyName="Advanced Mind Shield"
FriendlyNamePlural="Advanced Mind Shield"
BriefSummary="The Advanced Mind Shield takes all the benefits of the base Mind Shield and adds a small healing bonus."
TacticalText="<bullet/> Allows a soldier to Regen 1 HP a turn for up to 4 turns.\n<Bullet/> Grants the MINDSHIELD Ability."

[AdvancedMindShieldBonus X2AbilityTemplate]
LocFriendlyName="Advanced Mind Shield"
LocFlyOverText="Advanced Mind Shield"
LocHelpText="Advanced Mind Shield."
LocLongDescription="Grants the user immunities to mental attacks as well as stun and Unconsious effects while giving a small HP regen bonus if the uses takes HP damage."
LocPromotionPopupText="<Bullet/> Through the MINDSHIELD Ability, you are are immune to Mental attacks as well as stun and Unconscious effects."

